//////////////////////////
// 星座权重
//////////////////////////
const starWeights = {
  "白羊座": { "狮子座": 4, "射手座": 4, "双子座": 3, "水瓶座": 3, "天秤座": 2 },
  "金牛座": { "处女座": 4, "摩羯座": 4, "巨蟹座": 3, "双鱼座": 3, "天蝎座": 2 },
  "双子座": { "天秤座": 4, "水瓶座": 4, "白羊座": 3, "狮子座": 3, "射手座": 2 },
  "巨蟹座": { "天蝎座": 4, "双鱼座": 4, "金牛座": 3, "处女座": 3, "摩羯座": 2 },
  "狮子座": { "白羊座": 4, "射手座": 4, "天秤座": 3, "双子座": 3, "水瓶座": 2 },
  "处女座": { "金牛座": 4, "摩羯座": 4, "巨蟹座": 3, "天蝎座": 3, "双鱼座": 2 },
  "天秤座": { "双子座": 4, "水瓶座": 4, "狮子座": 3, "射手座": 3, "白羊座": 2 },
  "天蝎座": { "巨蟹座": 4, "双鱼座": 4, "处女座": 3, "摩羯座": 3, "金牛座": 2 },
  "射手座": { "白羊座": 4, "狮子座": 4, "水瓶座": 3, "天秤座": 3, "双子座": 2 },
  "摩羯座": { "金牛座": 4, "处女座": 4, "天蝎座": 3, "双鱼座": 3, "巨蟹座": 2 },
  "水瓶座": { "双子座": 4, "天秤座": 4, "白羊座": 3, "射手座": 3, "狮子座": 2 },
  "双鱼座": { "巨蟹座": 4, "天蝎座": 4, "金牛座": 3, "摩羯座": 3, "处女座": 2 }
};

//////////////////////////
// MBTI权重
//////////////////////////
const mbtiWeights = {
  "INTJ": { "ENFP": 4, "ENTP": 4, "INFJ": 3, "INFP": 3, "INTP": 2 },
  "INTP": { "ENTJ": 4, "ENFJ": 4, "INTJ": 3, "INFP": 3, "ENTP": 2 },
  "ENTJ": { "INTP": 4, "INFP": 4, "ENTP": 3, "ENFJ": 3, "INTJ": 2 },
  "ENTP": { "INFJ": 4, "INTJ": 4, "ENFP": 3, "ENTJ": 3, "INTP": 2 },
  "INFJ": { "ENFP": 4, "ENTP": 4, "INTJ": 3, "INFP": 3, "ENFJ": 2 },
  "INFP": { "ENFJ": 4, "ENTJ": 4, "INFJ": 3, "ISFP": 3, "INTP": 2 },
  "ENFJ": { "INFP": 4, "ISFP": 4, "INFJ": 3, "ENTP": 3, "ENFP": 2 },
  "ENFP": { "INTJ": 4, "INFJ": 4, "ENFJ": 3, "ENTP": 3, "INFP": 2 },
  "ISTJ": { "ESFP": 4, "ESTP": 4, "ISFJ": 3, "ISTP": 3, "ESTJ": 2 },
  "ISFJ": { "ESTP": 4, "ESFP": 4, "ISTJ": 3, "ISFP": 3, "ESFJ": 2 },
  "ESTJ": { "ISFP": 4, "ISTP": 4, "ESFJ": 3, "ESTP": 3, "ISTJ": 2 },
  "ESFJ": { "ISFP": 4, "ISTP": 4, "ESFP": 3, "ESTJ": 3, "ISFJ": 2 },
  "ISTP": { "ESFJ": 4, "ESTJ": 4, "ISFP": 3, "INTP": 3, "ESTP": 2 },
  "ISFP": { "ENFJ": 4, "ESFJ": 4, "INFP": 3, "ISTP": 3, "ESFP": 2 },
  "ESTP": { "ISFJ": 4, "ISTJ": 4, "ESFP": 3, "ESTJ": 3, "ISTP": 2 },
  "ESFP": { "ISTJ": 4, "ISFJ": 4, "ENFP": 3, "ESFJ": 3, "ISFP": 2 }
};